
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/bc491509-f7e2-44ef-9612-5cd7ed131726/terraform-bin plan -no-color
2024-05-23T10:33:53.941Z [INFO]  Terraform version: 1.8.1
2024-05-23T10:33:53.941Z [INFO]  Go runtime version: go1.22.1
2024-05-23T10:33:53.941Z [INFO]  CLI args: []string{"/home/runner/work/_temp/bc491509-f7e2-44ef-9612-5cd7ed131726/terraform-bin", "plan", "-no-color"}
2024-05-23T10:33:53.941Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-05-23T10:33:53.945Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=b5b94829-d006-ab18-e786-9fe110deefe5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-05-23T10:33:54.677Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=b5b94829-d006-ab18-e786-9fe110deefe5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-23T10:33:54.857Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=b5b94829-d006-ab18-e786-9fe110deefe5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-23T10:33:55.227Z [INFO]  backend/local: starting Plan operation
2024-05-23T10:33:55.817Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=da5bc48d-37d1-08d3-45e0-ad4ada287fb1 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-23T10:33:56.223Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T10:33:56.308Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:56.308Z
2024-05-23T10:33:56.980Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T10:33:56.989Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:56.988Z
2024-05-23T10:33:57.017Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T10:33:57.026Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:57.026Z
2024-05-23T10:33:57.049Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T10:33:57.133Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:57.133Z
2024-05-23T10:33:57.265Z [INFO]  backend/local: plan calling Plan
2024-05-23T10:33:57.268Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T10:33:57.277Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:57.277Z
2024-05-23T10:33:57.301Z [INFO]  provider: configuring client automatic mTLS
2024-05-23T10:33:57.378Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:57.378Z
2024-05-23T10:33:57.519Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved credentials: @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=3eb09c13-661a-b914-f87c-770d187021b4 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 tf_aws.credentials_source=EnvConfigCredentials tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider timestamp=2024-05-23T10:33:57.519Z
2024-05-23T10:33:58.279Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved caller identity from STS: tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=3eb09c13-661a-b914-f87c-770d187021b4 tf_rpc=ConfigureProvider timestamp=2024-05-23T10:33:58.279Z
data.aws_ami.ubuntu: Reading...
aws_iam_policy.rds_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/rds-management-policy]
aws_iam_role_policy_attachment.asg_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145856309600000001]
aws_iam_policy.asg_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/autoscaling-management-policy]
aws_iam_role_policy_attachment.rds_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145946165200000001]
aws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-00c0a6b6c9e473ec0]
aws_iam_role.lambda_role: Refreshing state... [id=algosolved-lambda-role]
aws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]
2024-05-23T10:33:58.293Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_subnet_group.algosovled-subnet-group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
2024-05-23T10:33:58.295Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-rds-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})
      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("172.31.0.0/16")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(65535)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("172.31.0.0/16")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("TCP"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(65535)})})
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2024-05-23T10:33:58.302Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_instance.algosolved-rdb, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .copy_tags_to_snapshot: planned value cty.False for a non-computed attribute
      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})
      - .apply_immediately: planned value cty.False for a non-computed attribute
      - .performance_insights_enabled: planned value cty.False for a non-computed attribute
      - .dedicated_log_volume: planned value cty.False for a non-computed attribute
      - .publicly_accessible: planned value cty.False for a non-computed attribute
      - .skip_final_snapshot: planned value cty.False for a non-computed attribute
      - .auto_minor_version_upgrade: planned value cty.True for a non-computed attribute
      - .delete_automated_backups: planned value cty.True for a non-computed attribute
      - .monitoring_interval: planned value cty.NumberIntVal(0) for a non-computed attribute
2024-05-23T10:33:58.494Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.rds_management_policy during refresh.
      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)
2024-05-23T10:33:58.495Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.asg_management_policy during refresh.
      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)
2024-05-23T10:33:58.562Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_role.lambda_role during refresh.
      - .managed_policy_arns: actual set element cty.StringVal("arn:aws:iam::471112990651:policy/rds-management-policy") does not correlate with any element in plan
      - .managed_policy_arns: length changed from 1 to 2
2024-05-23T10:33:59.197Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2024-05-23T10:33:59.314Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_ecr_repository.algosolved_repository during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
2024-05-23T10:33:59.316Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .encryption_configuration: block count in plan (1) disagrees with count in config (0)
      - .image_scanning_configuration: block count in plan (1) disagrees with count in config (0)
data.aws_ami.ubuntu: Read complete after 2s [id=ami-00dade17b7cbec931]
aws_launch_template.algosolved-lt: Refreshing state... [id=lt-040a43fee0df84a02]
2024-05-23T10:33:59.983Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_launch_template.algosolved-lt during refresh.
      - .security_group_names: was null, but now cty.SetValEmpty(cty.String)
2024-05-23T10:33:59.992Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .kernel_id: planned value cty.StringVal("") for a non-computed attribute
      - .ram_disk_id: planned value cty.StringVal("") for a non-computed attribute
      - .disable_api_termination: planned value cty.False for a non-computed attribute
      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)}) nor prior value cty.SetVal([]cty.Value{cty.StringVal("sg-00c0a6b6c9e473ec0")})
      - .user_data: planned value cty.StringVal("") for a non-computed attribute
      - .disable_api_stop: planned value cty.False for a non-computed attribute
      - .ebs_optimized: planned value cty.StringVal("") for a non-computed attribute
      - .instance_initiated_shutdown_behavior: planned value cty.StringVal("") for a non-computed attribute
      - .security_group_names: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .block_device_mappings[0].virtual_name: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].no_device: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].encrypted: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].kms_key_id: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].snapshot_id: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].delete_on_termination: planned value cty.StringVal("") for a non-computed attribute
aws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]
2024-05-23T10:34:00.845Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_autoscaling_group.algosolved-ec2-asg during refresh.
      - .enabled_metrics: was null, but now cty.SetValEmpty(cty.String)
      - .termination_policies: was null, but now cty.ListValEmpty(cty.String)
      - .suspended_processes: was null, but now cty.SetValEmpty(cty.String)
2024-05-23T10:34:00.865Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .context: planned value cty.StringVal("") for a non-computed attribute
      - .protect_from_scale_in: planned value cty.False for a non-computed attribute
      - .enabled_metrics: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .launch_configuration: planned value cty.StringVal("") for a non-computed attribute
      - .max_instance_lifetime: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .termination_policies: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute
      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute
      - .placement_group: planned value cty.StringVal("") for a non-computed attribute
      - .desired_capacity_type: planned value cty.StringVal("") for a non-computed attribute
      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute
      - .capacity_rebalance: planned value cty.False for a non-computed attribute
      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute
      - .suspended_processes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute
      - .default_instance_warmup: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .force_delete: planned value cty.False for a non-computed attribute
2024-05-23T10:34:00.878Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.algosolved-rdb will be created
  + resource "aws_db_instance" "algosolved-rdb" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "algosolved-rdb"
      + db_subnet_group_name                  = "algosolved-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "16"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all                              = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + timezone                              = (known after apply)
      + username                              = "root"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.algosovled-subnet-group will be created
  + resource "aws_db_subnet_group" "algosovled-subnet-group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "algosolved-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-022ebfb190dada9ed",
          + "subnet-048b88ec2d0a464ca",
          + "subnet-04ffdab2c1330fa72",
          + "subnet-0b62b774eb479dfca",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all                = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_ecr_repository.algosolved_repository will be updated in-place
  ~ resource "aws_ecr_repository" "algosolved_repository" {
        id                   = "algosolved-ecr"
        name                 = "algosolved-ecr"
        tags                 = {}
      ~ tags_all             = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.asg_management_policy will be destroyed
  # (because aws_iam_policy.asg_management_policy is not in configuration)
  - resource "aws_iam_policy" "asg_management_policy" {
      - arn              = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null
      - attachment_count = 1 -> null
      - description      = "Policy to manage AutoScaling groups" -> null
      - id               = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null
      - name             = "autoscaling-management-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:UpdateAutoScalingGroup"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAW3MEFX65WIL4NBCRH" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_policy.rds_management_policy will be destroyed
  # (because aws_iam_policy.rds_management_policy is not in configuration)
  - resource "aws_iam_policy" "rds_management_policy" {
      - arn              = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null
      - attachment_count = 1 -> null
      - description      = "Policy to manage RDS instances" -> null
      - id               = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null
      - name             = "rds-management-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "rds:DescribeDBInstances",
                          - "rds: StopDBInstance",
                          - "rds: StartDBInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAW3MEFX652XFQDBRBG" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.lambda_role will be destroyed
  # (because aws_iam_role.lambda_role is not in configuration)
  - resource "aws_iam_role" "lambda_role" {
      - arn                   = "arn:aws:iam::471112990651:role/algosolved-lambda-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-05-14T14:58:10Z" -> null
      - force_detach_policies = false -> null
      - id                    = "algosolved-lambda-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::471112990651:policy/autoscaling-management-policy",
          - "arn:aws:iam::471112990651:policy/rds-management-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "algosolved-lambda-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAW3MEFX65ZT3NCLPLA" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.asg_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.asg_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "asg_policy_attachment" {
      - id         = "algosolved-lambda-role-20240514145856309600000001" -> null
      - policy_arn = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null
      - role       = "algosolved-lambda-role" -> null
    }

  # aws_iam_role_policy_attachment.rds_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.rds_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "rds_policy_attachment" {
      - id         = "algosolved-lambda-role-20240514145946165200000001" -> null
      - policy_arn = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null
      - role       = "algosolved-lambda-role" -> null
    }

  # aws_launch_template.algosolved-lt will be updated in-place
  ~ resource "aws_launch_template" "algosolved-lt" {
        id                                   = "lt-040a43fee0df84a02"
      ~ latest_version                       = 1 -> (known after apply)
        name                                 = "algosolved-launch-template"
        tags                                 = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
      ~ vpc_security_group_ids               = [
          - "sg-00c0a6b6c9e473ec0",
        ] -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_security_group.algosolved-ec2-sg must be replaced
-/+ resource "aws_security_group" "algosolved-ec2-sg" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-2:471112990651:security-group/sg-00c0a6b6c9e473ec0" -> (known after apply)
      ~ description            = "Allow vpc network" -> "Algosolved EC2 Security Group" # forces replacement
      ~ id                     = "sg-00c0a6b6c9e473ec0" -> (known after apply)
        name                   = "algosolved-ec2-sgp"
      + name_prefix            = (known after apply)
      ~ owner_id               = "471112990651" -> (known after apply)
        tags                   = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.algosolved-rds-sg will be created
  + resource "aws_security_group" "algosolved-rds-sg" {
      + arn                    = (known after apply)
      + description            = "Algosolved RDS Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "172.31.0.0/16",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "algosolved-rds-sgp"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all               = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + vpc_id                 = "vpc-0f87a26ea18c1b807"
    }

  # random_string.password will be created
  + resource "random_string" "password" {
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 5 to add, 2 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: data.aws_ami.ubuntu: Reading...%0Aaws_iam_policy.rds_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/rds-management-policy]%0Aaws_iam_role_policy_attachment.asg_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145856309600000001]%0Aaws_iam_policy.asg_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/autoscaling-management-policy]%0Aaws_iam_role_policy_attachment.rds_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145946165200000001]%0Aaws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-00c0a6b6c9e473ec0]%0Aaws_iam_role.lambda_role: Refreshing state... [id=algosolved-lambda-role]%0Aaws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]%0Adata.aws_ami.ubuntu: Read complete after 2s [id=ami-00dade17b7cbec931]%0Aaws_launch_template.algosolved-lt: Refreshing state... [id=lt-040a43fee0df84a02]%0Aaws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_db_instance.algosolved-rdb will be created%0A  + resource "aws_db_instance" "algosolved-rdb" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 10%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "algosolved-rdb"%0A      + db_subnet_group_name                  = "algosolved-subnet-group"%0A      + dedicated_log_volume                  = false%0A      + delete_automated_backups              = true%0A      + domain_fqdn                           = (known after apply)%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_version                        = "16"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = (known after apply)%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t2.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = (known after apply)%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = false%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = false%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = (known after apply)%0A      + tags                                  = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                              = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + timezone                              = (known after apply)%0A      + username                              = "root"%0A      + vpc_security_group_ids                = (known after apply)%0A    }%0A%0A  # aws_db_subnet_group.algosovled-subnet-group will be created%0A  + resource "aws_db_subnet_group" "algosovled-subnet-group" {%0A      + arn                     = (known after apply)%0A      + description             = "Managed by Terraform"%0A      + id                      = (known after apply)%0A      + name                    = "algosolved-subnet-group"%0A      + name_prefix             = (known after apply)%0A      + subnet_ids              = [%0A          + "subnet-022ebfb190dada9ed",%0A          + "subnet-048b88ec2d0a464ca",%0A          + "subnet-04ffdab2c1330fa72",%0A          + "subnet-0b62b774eb479dfca",%0A        ]%0A      + supported_network_types = (known after apply)%0A      + tags                    = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                  = (known after apply)%0A    }%0A%0A  # aws_ecr_repository.algosolved_repository will be updated in-place%0A  ~ resource "aws_ecr_repository" "algosolved_repository" {%0A        id                   = "algosolved-ecr"%0A        name                 = "algosolved-ecr"%0A        tags                 = {}%0A      ~ tags_all             = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A        # (4 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_iam_policy.asg_management_policy will be destroyed%0A  # (because aws_iam_policy.asg_management_policy is not in configuration)%0A  - resource "aws_iam_policy" "asg_management_policy" {%0A      - arn              = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null%0A      - attachment_count = 1 -> null%0A      - description      = "Policy to manage AutoScaling groups" -> null%0A      - id               = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null%0A      - name             = "autoscaling-management-policy" -> null%0A      - path             = "/" -> null%0A      - policy           = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = "autoscaling:UpdateAutoScalingGroup"%0A                      - Effect   = "Allow"%0A                      - Resource = "*"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - policy_id        = "ANPAW3MEFX65WIL4NBCRH" -> null%0A      - tags             = {} -> null%0A      - tags_all         = {} -> null%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # aws_iam_policy.rds_management_policy will be destroyed%0A  # (because aws_iam_policy.rds_management_policy is not in configuration)%0A  - resource "aws_iam_policy" "rds_management_policy" {%0A      - arn              = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null%0A      - attachment_count = 1 -> null%0A      - description      = "Policy to manage RDS instances" -> null%0A      - id               = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null%0A      - name             = "rds-management-policy" -> null%0A      - path             = "/" -> null%0A      - policy           = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = [%0A                          - "rds:DescribeDBInstances",%0A                          - "rds: StopDBInstance",%0A                          - "rds: StartDBInstance",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "*"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - policy_id        = "ANPAW3MEFX652XFQDBRBG" -> null%0A      - tags             = {} -> null%0A      - tags_all         = {} -> null%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # aws_iam_role.lambda_role will be destroyed%0A  # (because aws_iam_role.lambda_role is not in configuration)%0A  - resource "aws_iam_role" "lambda_role" {%0A      - arn                   = "arn:aws:iam::471112990651:role/algosolved-lambda-role" -> null%0A      - assume_role_policy    = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "sts:AssumeRole"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Service = "lambda.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - create_date           = "2024-05-14T14:58:10Z" -> null%0A      - force_detach_policies = false -> null%0A      - id                    = "algosolved-lambda-role" -> null%0A      - managed_policy_arns   = [%0A          - "arn:aws:iam::471112990651:policy/autoscaling-management-policy",%0A          - "arn:aws:iam::471112990651:policy/rds-management-policy",%0A        ] -> null%0A      - max_session_duration  = 3600 -> null%0A      - name                  = "algosolved-lambda-role" -> null%0A      - path                  = "/" -> null%0A      - tags                  = {} -> null%0A      - tags_all              = {} -> null%0A      - unique_id             = "AROAW3MEFX65ZT3NCLPLA" -> null%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # aws_iam_role_policy_attachment.asg_policy_attachment will be destroyed%0A  # (because aws_iam_role_policy_attachment.asg_policy_attachment is not in configuration)%0A  - resource "aws_iam_role_policy_attachment" "asg_policy_attachment" {%0A      - id         = "algosolved-lambda-role-20240514145856309600000001" -> null%0A      - policy_arn = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null%0A      - role       = "algosolved-lambda-role" -> null%0A    }%0A%0A  # aws_iam_role_policy_attachment.rds_policy_attachment will be destroyed%0A  # (because aws_iam_role_policy_attachment.rds_policy_attachment is not in configuration)%0A  - resource "aws_iam_role_policy_attachment" "rds_policy_attachment" {%0A      - id         = "algosolved-lambda-role-20240514145946165200000001" -> null%0A      - policy_arn = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null%0A      - role       = "algosolved-lambda-role" -> null%0A    }%0A%0A  # aws_launch_template.algosolved-lt will be updated in-place%0A  ~ resource "aws_launch_template" "algosolved-lt" {%0A        id                                   = "lt-040a43fee0df84a02"%0A      ~ latest_version                       = 1 -> (known after apply)%0A        name                                 = "algosolved-launch-template"%0A        tags                                 = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A      ~ vpc_security_group_ids               = [%0A          - "sg-00c0a6b6c9e473ec0",%0A        ] -> (known after apply)%0A        # (16 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # aws_security_group.algosolved-ec2-sg must be replaced%0A-/+ resource "aws_security_group" "algosolved-ec2-sg" {%0A      ~ arn                    = "arn:aws:ec2:ap-northeast-2:471112990651:security-group/sg-00c0a6b6c9e473ec0" -> (known after apply)%0A      ~ description            = "Allow vpc network" -> "Algosolved EC2 Security Group" # forces replacement%0A      ~ id                     = "sg-00c0a6b6c9e473ec0" -> (known after apply)%0A        name                   = "algosolved-ec2-sgp"%0A      + name_prefix            = (known after apply)%0A      ~ owner_id               = "471112990651" -> (known after apply)%0A        tags                   = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.algosolved-rds-sg will be created%0A  + resource "aws_security_group" "algosolved-rds-sg" {%0A      + arn                    = (known after apply)%0A      + description            = "Algosolved RDS Security Group"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "172.31.0.0/16",%0A                ]%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 65535%0A                # (1 unchanged attribute hidden)%0A            },%0A        ]%0A      + name                   = "algosolved-rds-sgp"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all               = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                 = "vpc-0f87a26ea18c1b807"%0A    }%0A%0A  # random_string.password will be created%0A  + resource "random_string" "password" {%0A      + id          = (known after apply)%0A      + length      = 16%0A      + lower       = true%0A      + min_lower   = 0%0A      + min_numeric = 0%0A      + min_special = 0%0A      + min_upper   = 0%0A      + number      = true%0A      + numeric     = true%0A      + result      = (known after apply)%0A      + special     = false%0A      + upper       = true%0A    }%0A%0APlan: 5 to add, 2 to change, 6 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-05-23T10:33:53.941Z [INFO]  Terraform version: 1.8.1%0A2024-05-23T10:33:53.941Z [INFO]  Go runtime version: go1.22.1%0A2024-05-23T10:33:53.941Z [INFO]  CLI args: []string{"/home/runner/work/_temp/bc491509-f7e2-44ef-9612-5cd7ed131726/terraform-bin", "plan", "-no-color"}%0A2024-05-23T10:33:53.941Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-05-23T10:33:53.945Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=b5b94829-d006-ab18-e786-9fe110deefe5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-05-23T10:33:54.677Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=b5b94829-d006-ab18-e786-9fe110deefe5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-23T10:33:54.857Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=b5b94829-d006-ab18-e786-9fe110deefe5 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-23T10:33:55.227Z [INFO]  backend/local: starting Plan operation%0A2024-05-23T10:33:55.817Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=da5bc48d-37d1-08d3-45e0-ad4ada287fb1 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-23T10:33:56.223Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T10:33:56.308Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:56.308Z%0A2024-05-23T10:33:56.980Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T10:33:56.989Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:56.988Z%0A2024-05-23T10:33:57.017Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T10:33:57.026Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:57.026Z%0A2024-05-23T10:33:57.049Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T10:33:57.133Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:57.133Z%0A2024-05-23T10:33:57.265Z [INFO]  backend/local: plan calling Plan%0A2024-05-23T10:33:57.268Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T10:33:57.277Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:57.277Z%0A2024-05-23T10:33:57.301Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-23T10:33:57.378Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-23T10:33:57.378Z%0A2024-05-23T10:33:57.519Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved credentials: @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=3eb09c13-661a-b914-f87c-770d187021b4 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 tf_aws.credentials_source=EnvConfigCredentials tf_provider_addr=registry.terraform.io/hashicorp/aws tf_rpc=ConfigureProvider timestamp=2024-05-23T10:33:57.519Z%0A2024-05-23T10:33:58.279Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved caller identity from STS: tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_req_id=3eb09c13-661a-b914-f87c-770d187021b4 tf_rpc=ConfigureProvider timestamp=2024-05-23T10:33:58.279Z%0A2024-05-23T10:33:58.293Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_subnet_group.algosovled-subnet-group, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute%0A2024-05-23T10:33:58.295Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-rds-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .egress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("-1"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(0)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("0.0.0.0/0")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("-1"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(0)})})%0A      - .ingress: planned value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("172.31.0.0/16")}), "description":cty.StringVal(""), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.ListValEmpty(cty.String), "prefix_list_ids":cty.ListValEmpty(cty.String), "protocol":cty.StringVal("tcp"), "security_groups":cty.SetValEmpty(cty.String), "self":cty.False, "to_port":cty.NumberIntVal(65535)})}) does not match config value cty.SetVal([]cty.Value{cty.ObjectVal(map[string]cty.Value{"cidr_blocks":cty.ListVal([]cty.Value{cty.StringVal("172.31.0.0/16")}), "description":cty.NullVal(cty.String), "from_port":cty.NumberIntVal(0), "ipv6_cidr_blocks":cty.NullVal(cty.List(cty.String)), "prefix_list_ids":cty.NullVal(cty.List(cty.String)), "protocol":cty.StringVal("TCP"), "security_groups":cty.NullVal(cty.Set(cty.String)), "self":cty.NullVal(cty.Bool), "to_port":cty.NumberIntVal(65535)})})%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A2024-05-23T10:33:58.302Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_instance.algosolved-rdb, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .copy_tags_to_snapshot: planned value cty.False for a non-computed attribute%0A      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)})%0A      - .apply_immediately: planned value cty.False for a non-computed attribute%0A      - .performance_insights_enabled: planned value cty.False for a non-computed attribute%0A      - .dedicated_log_volume: planned value cty.False for a non-computed attribute%0A      - .publicly_accessible: planned value cty.False for a non-computed attribute%0A      - .skip_final_snapshot: planned value cty.False for a non-computed attribute%0A      - .auto_minor_version_upgrade: planned value cty.True for a non-computed attribute%0A      - .delete_automated_backups: planned value cty.True for a non-computed attribute%0A      - .monitoring_interval: planned value cty.NumberIntVal(0) for a non-computed attribute%0A2024-05-23T10:33:58.494Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.rds_management_policy during refresh.%0A      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)%0A2024-05-23T10:33:58.495Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.asg_management_policy during refresh.%0A      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)%0A2024-05-23T10:33:58.562Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_role.lambda_role during refresh.%0A      - .managed_policy_arns: actual set element cty.StringVal("arn:aws:iam::471112990651:policy/rds-management-policy") does not correlate with any element in plan%0A      - .managed_policy_arns: length changed from 1 to 2%0A2024-05-23T10:33:59.197Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A2024-05-23T10:33:59.314Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_ecr_repository.algosolved_repository during refresh.%0A      - .tags: was null, but now cty.MapValEmpty(cty.String)%0A2024-05-23T10:33:59.316Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .encryption_configuration: block count in plan (1) disagrees with count in config (0)%0A      - .image_scanning_configuration: block count in plan (1) disagrees with count in config (0)%0A2024-05-23T10:33:59.983Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_launch_template.algosolved-lt during refresh.%0A      - .security_group_names: was null, but now cty.SetValEmpty(cty.String)%0A2024-05-23T10:33:59.992Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .kernel_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .ram_disk_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .disable_api_termination: planned value cty.False for a non-computed attribute%0A      - .vpc_security_group_ids: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)}) nor prior value cty.SetVal([]cty.Value{cty.StringVal("sg-00c0a6b6c9e473ec0")})%0A      - .user_data: planned value cty.StringVal("") for a non-computed attribute%0A      - .disable_api_stop: planned value cty.False for a non-computed attribute%0A      - .ebs_optimized: planned value cty.StringVal("") for a non-computed attribute%0A      - .instance_initiated_shutdown_behavior: planned value cty.StringVal("") for a non-computed attribute%0A      - .security_group_names: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .block_device_mappings[0].virtual_name: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].no_device: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].encrypted: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].kms_key_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].snapshot_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].delete_on_termination: planned value cty.StringVal("") for a non-computed attribute%0A2024-05-23T10:34:00.845Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_autoscaling_group.algosolved-ec2-asg during refresh.%0A      - .enabled_metrics: was null, but now cty.SetValEmpty(cty.String)%0A      - .termination_policies: was null, but now cty.ListValEmpty(cty.String)%0A      - .suspended_processes: was null, but now cty.SetValEmpty(cty.String)%0A2024-05-23T10:34:00.865Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .context: planned value cty.StringVal("") for a non-computed attribute%0A      - .protect_from_scale_in: planned value cty.False for a non-computed attribute%0A      - .enabled_metrics: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .launch_configuration: planned value cty.StringVal("") for a non-computed attribute%0A      - .max_instance_lifetime: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .termination_policies: planned value cty.ListValEmpty(cty.String) for a non-computed attribute%0A      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute%0A      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute%0A      - .placement_group: planned value cty.StringVal("") for a non-computed attribute%0A      - .desired_capacity_type: planned value cty.StringVal("") for a non-computed attribute%0A      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute%0A      - .capacity_rebalance: planned value cty.False for a non-computed attribute%0A      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute%0A      - .suspended_processes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute%0A      - .default_instance_warmup: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .force_delete: planned value cty.False for a non-computed attribute%0A2024-05-23T10:34:00.878Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @youngjun0627**